In [1]:
#DS Basics
import numpy as np
import pandas as pd
import pandas_profiling
import matplotlib.pyplot as plt
import seaborn as sns
from sqlalchemy import create_engine
import pymysql
import csv 
import sys
import pyodbc

# SKLearn Stuff
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, classification_report
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import cross_val_score
from sklearn.preprocessing import KBinsDiscretizer

#helpers
%matplotlib inline

In [2]:
# Create a connection
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'

# Connect to MySQL instance
db_connection = create_engine(db_connection_str)

# Using SELECT statement and query the Credit One data to extract it into a Pandas dataframe
df = pd.read_sql('SELECT * FROM credit', con=db_connection)

In [31]:
# Write Pandas DataFrame to CSV File
df.to_csv('credit_1_dataframe.csv', index = False)
print(df)

      MyUnknownColumn         X1      X2           X3        X4   X5     X6  \
0                  ID  LIMIT_BAL     SEX    EDUCATION  MARRIAGE  AGE  PAY_0
1                   1      20000  female   university         1   24      2
2                   2     120000  female   university         2   26     -1
3                   3      90000  female   university         2   34      0
4                   4      50000  female   university         1   37      0
...               ...        ...     ...          ...       ...  ...    ...
30199           29996     220000    male  high school         1   39      0
30200           29997     150000    male  high school         2   43     -1
30201           29998      30000    male   university         2   37      4
30202           29999      80000    male  high school         1   41      1
30203           30000      50000    male   university         1   46      0

          X7     X8     X9  ...        X15        X16        X17       X18  \
0      PAY_2  PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1
1          2     -1     -1  ...          0          0          0         0
2          2      0      0  ...       3272       3455       3261         0
3          0      0      0  ...      14331      14948      15549      1518
4          0      0      0  ...      28314      28959      29547      2000
...      ...    ...    ...  ...        ...        ...        ...       ...
30199      0      0      0  ...      88004      31237      15980      8500
30200     -1     -1     -1  ...       8979       5190          0      1837
30201      3      2     -1  ...      20878      20582      19357         0
30202     -1      0      0  ...      52774      11855      48944     85900
30203      0      0      0  ...      36535      32428      15313      2078

            X19       X20       X21       X22       X23  \
0      PAY_AMT2  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6
1           689         0         0         0         0
2          1000      1000      1000         0      2000
3          1500      1000      1000      1000      5000
4          2019      1200      1100      1069      1000
...         ...       ...       ...       ...       ...
30199     20000      5003      3047      5000      1000
30200      3526      8998       129         0         0
30201         0     22000      4200      2000      3100
30202      3409      1178      1926     52964      1804
30203      1800      1430      1000      1000      1000

                                Y
0      default payment next month
1                         default
2                         default
3                     not default
4                     not default
...                           ...
30199                 not default
30200                 not default
30201                     default
30202                     default
30203                     default

[30204 rows x 25 columns]

In [95]:
# Import CSV File
df = pd.read_csv ('credit_1_dataframe.csv', header=1,)
print(df)

          ID LIMIT_BAL     SEX    EDUCATION MARRIAGE AGE PAY_0 PAY_2 PAY_3  \
0          1     20000  female   university        1  24     2     2    -1
1          2    120000  female   university        2  26    -1     2     0
2          3     90000  female   university        2  34     0     0     0
3          4     50000  female   university        1  37     0     0     0
4          5     50000    male   university        1  57    -1     0    -1
...      ...       ...     ...          ...      ...  ..   ...   ...   ...
30198  29996    220000    male  high school        1  39     0     0     0
30199  29997    150000    male  high school        2  43    -1    -1    -1
30200  29998     30000    male   university        2  37     4     3     2
30201  29999     80000    male  high school        1  41     1    -1     0
30202  30000     50000    male   university        1  46     0     0     0

      PAY_4  ... BILL_AMT4 BILL_AMT5 BILL_AMT6 PAY_AMT1 PAY_AMT2 PAY_AMT3  \
0        -1  ...         0         0         0        0      689        0
1         0  ...      3272      3455      3261        0     1000     1000
2         0  ...     14331     14948     15549     1518     1500     1000
3         0  ...     28314     28959     29547     2000     2019     1200
4         0  ...     20940     19146     19131     2000    36681    10000
...     ...  ...       ...       ...       ...      ...      ...      ...
30198     0  ...     88004     31237     15980     8500    20000     5003
30199    -1  ...      8979      5190         0     1837     3526     8998
30200    -1  ...     20878     20582     19357        0        0    22000
30201     0  ...     52774     11855     48944    85900     3409     1178
30202     0  ...     36535     32428     15313     2078     1800     1430

      PAY_AMT4 PAY_AMT5 PAY_AMT6 default payment next month
0            0        0        0                    default
1         1000        0     2000                    default
2         1000     1000     5000                not default
3         1100     1069     1000                not default
4         9000      689      679                not default
...        ...      ...      ...                        ...
30198     3047     5000     1000                not default
30199      129        0        0                not default
30200     4200     2000     3100                    default
30201     1926    52964     1804                    default
30202     1000     1000     1000                    default

[30203 rows x 25 columns]

In [93]:
# Quick check of the data
df.head(205)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
1,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,201,180000,female,graduate school,1,38,-2,-2,-2,-2,...,0,0,0,0,0,0,0,0,0,not default
201,NaN,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
202,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
404,202,140000,male,graduate school,2,31,0,0,2,0,...,20225,27407,10833,25000,0,3000,7800,0,2500,not default
405,203,140000,female,graduate school,2,26,-1,0,-1,-1,...,5818,13506,487,10000,13001,5841,13506,487,7004,not default

In [43]:
# Describe the data set
df.describe()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
count,30202,30203,30203,30203,30203,30203,30203,30203,30203,30203,...,30203,30203,30203,30203,30203,30203,30203,30203,30203,30203
unique,30001,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,1,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,2,3397,18217,14107,16088,1619,14828,15830,15863,16566,...,3218,3530,4045,5287,5437,6007,6450,6744,7233,23519

In [44]:
# Check of the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30203 entries, 0 to 30202
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30202 non-null  object
 1   LIMIT_BAL                   30203 non-null  object
 2   SEX                         30203 non-null  object
 3   EDUCATION                   30203 non-null  object
 4   MARRIAGE                    30203 non-null  object
 5   AGE                         30203 non-null  object
 6   PAY_0                       30203 non-null  object
 7   PAY_2                       30203 non-null  object
 8   PAY_3                       30203 non-null  object
 9   PAY_4                       30203 non-null  object
 10  PAY_5                       30203 non-null  object
 11  PAY_6                       30203 non-null  object
 12  BILL_AMT1                   30203 non-null  object
 13  BILL_AMT2                   30203 non-null  object
 14  BILL_AMT3                   30203 non-null  object
 15  BILL_AMT4                   30203 non-null  object
 16  BILL_AMT5                   30203 non-null  object
 17  BILL_AMT6                   30203 non-null  object
 18  PAY_AMT1                    30203 non-null  object
 19  PAY_AMT2                    30203 non-null  object
 20  PAY_AMT3                    30203 non-null  object
 21  PAY_AMT4                    30203 non-null  object
 22  PAY_AMT5                    30203 non-null  object
 23  PAY_AMT6                    30203 non-null  object
 24  default payment next month  30203 non-null  object
dtypes: object(25)
memory usage: 5.8+ MB

In [61]:
# Drop the duplicates
df = df.drop_duplicates()
df.dropna()
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30002 entries, 0 to 30202
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30001 non-null  object
 1   LIMIT_BAL                   30002 non-null  object
 2   SEX                         30002 non-null  object
 3   EDUCATION                   30002 non-null  object
 4   MARRIAGE                    30002 non-null  object
 5   AGE                         30002 non-null  object
 6   PAY_0                       30002 non-null  object
 7   PAY_2                       30002 non-null  object
 8   PAY_3                       30002 non-null  object
 9   PAY_4                       30002 non-null  object
 10  PAY_5                       30002 non-null  object
 11  PAY_6                       30002 non-null  object
 12  BILL_AMT1                   30002 non-null  object
 13  BILL_AMT2                   30002 non-null  object
 14  BILL_AMT3                   30002 non-null  object
 15  BILL_AMT4                   30002 non-null  object
 16  BILL_AMT5                   30002 non-null  object
 17  BILL_AMT6                   30002 non-null  object
 18  PAY_AMT1                    30002 non-null  object
 19  PAY_AMT2                    30002 non-null  object
 20  PAY_AMT3                    30002 non-null  object
 21  PAY_AMT4                    30002 non-null  object
 22  PAY_AMT5                    30002 non-null  object
 23  PAY_AMT6                    30002 non-null  object
 24  default payment next month  30002 non-null  object
dtypes: object(25)
memory usage: 6.0+ MB

In [68]:
# Missing values in the data set
df.isna().sum()

ID                            1
LIMIT_BAL                     0
SEX                           0
EDUCATION                     0
MARRIAGE                      0
AGE                           0
PAY_0                         0
PAY_2                         0
PAY_3                         0
PAY_4                         0
PAY_5                         0
PAY_6                         0
BILL_AMT1                     0
BILL_AMT2                     0
BILL_AMT3                     0
BILL_AMT4                     0
BILL_AMT5                     0
BILL_AMT6                     0
PAY_AMT1                      0
PAY_AMT2                      0
PAY_AMT3                      0
PAY_AMT4                      0
PAY_AMT5                      0
PAY_AMT6                      0
default payment next month    0
dtype: int64

In [63]:
# List the null values
df.isnull().head().sum()

ID                            0
LIMIT_BAL                     0
SEX                           0
EDUCATION                     0
MARRIAGE                      0
AGE                           0
PAY_0                         0
PAY_2                         0
PAY_3                         0
PAY_4                         0
PAY_5                         0
PAY_6                         0
BILL_AMT1                     0
BILL_AMT2                     0
BILL_AMT3                     0
BILL_AMT4                     0
BILL_AMT5                     0
BILL_AMT6                     0
PAY_AMT1                      0
PAY_AMT2                      0
PAY_AMT3                      0
PAY_AMT4                      0
PAY_AMT5                      0
PAY_AMT6                      0
default payment next month    0
dtype: int64

In [98]:
# Check with specific value is missing
df[df['ID'].isnull()].index.tolist()

[201]

In [119]:
df.iloc[200:204]

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
200,201,180000,female,graduate school,1,38,-2,-2,-2,-2,...,0,0,0,0,0,0,0,0,0,not default
203,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
204,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
205,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default

In [120]:
df.isna().sum()

ID                            0
LIMIT_BAL                     0
SEX                           0
EDUCATION                     0
MARRIAGE                      0
AGE                           0
PAY_0                         0
PAY_2                         0
PAY_3                         0
PAY_4                         0
PAY_5                         0
PAY_6                         0
BILL_AMT1                     0
BILL_AMT2                     0
BILL_AMT3                     0
BILL_AMT4                     0
BILL_AMT5                     0
BILL_AMT6                     0
PAY_AMT1                      0
PAY_AMT2                      0
PAY_AMT3                      0
PAY_AMT4                      0
PAY_AMT5                      0
PAY_AMT6                      0
default payment next month    0
dtype: int64

In [121]:
df.to_csv('credit_1update_dataframe.csv', index = False)

In [126]:
df = pd.read_csv ('credit_1update_dataframe.csv', header=0,)
print(df)

          ID  LIMIT_BAL     SEX    EDUCATION  MARRIAGE  AGE  PAY_0  PAY_2  \
0          1      20000  female   university         1   24      2      2
1          2     120000  female   university         2   26     -1      2
2          3      90000  female   university         2   34      0      0
3          4      50000  female   university         1   37      0      0
4          5      50000    male   university         1   57     -1      0
...      ...        ...     ...          ...       ...  ...    ...    ...
30196  29996     220000    male  high school         1   39      0      0
30197  29997     150000    male  high school         2   43     -1     -1
30198  29998      30000    male   university         2   37      4      3
30199  29999      80000    male  high school         1   41      1     -1
30200  30000      50000    male   university         1   46      0      0

       PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1  PAY_AMT2  \
0         -1     -1  ...          0          0          0         0       689
1          0      0  ...       3272       3455       3261         0      1000
2          0      0  ...      14331      14948      15549      1518      1500
3          0      0  ...      28314      28959      29547      2000      2019
4         -1      0  ...      20940      19146      19131      2000     36681
...      ...    ...  ...        ...        ...        ...       ...       ...
30196      0      0  ...      88004      31237      15980      8500     20000
30197     -1     -1  ...       8979       5190          0      1837      3526
30198      2     -1  ...      20878      20582      19357         0         0
30199      0      0  ...      52774      11855      48944     85900      3409
30200      0      0  ...      36535      32428      15313      2078      1800

       PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6  default payment next month
0             0         0         0         0                     default
1          1000      1000         0      2000                     default
2          1000      1000      1000      5000                 not default
3          1200      1100      1069      1000                 not default
4         10000      9000       689       679                 not default
...         ...       ...       ...       ...                         ...
30196      5003      3047      5000      1000                 not default
30197      8998       129         0         0                 not default
30198     22000      4200      2000      3100                     default
30199      1178      1926     52964      1804                     default
30200      1430      1000      1000      1000                     default

[30201 rows x 25 columns]

In [127]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30201 entries, 0 to 30200
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30201 non-null  int64
 1   LIMIT_BAL                   30201 non-null  int64
 2   SEX                         30201 non-null  object
 3   EDUCATION                   30201 non-null  object
 4   MARRIAGE                    30201 non-null  int64
 5   AGE                         30201 non-null  int64
 6   PAY_0                       30201 non-null  int64
 7   PAY_2                       30201 non-null  int64
 8   PAY_3                       30201 non-null  int64
 9   PAY_4                       30201 non-null  int64
 10  PAY_5                       30201 non-null  int64
 11  PAY_6                       30201 non-null  int64
 12  BILL_AMT1                   30201 non-null  int64
 13  BILL_AMT2                   30201 non-null  int64
 14  BILL_AMT3                   30201 non-null  int64
 15  BILL_AMT4                   30201 non-null  int64
 16  BILL_AMT5                   30201 non-null  int64
 17  BILL_AMT6                   30201 non-null  int64
 18  PAY_AMT1                    30201 non-null  int64
 19  PAY_AMT2                    30201 non-null  int64
 20  PAY_AMT3                    30201 non-null  int64
 21  PAY_AMT4                    30201 non-null  int64
 22  PAY_AMT5                    30201 non-null  int64
 23  PAY_AMT6                    30201 non-null  int64
 24  default payment next month  30201 non-null  object
dtypes: int64(22), object(3)
memory usage: 5.8+ MB

In [129]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
1,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default